/**
  *********************************************************************************************************
  * @file    led.c
  * @author  Devilhart -- KK
  * @version V0.0.1
  * @date    2019-02-19
  * @brief   1TAB = 5Speace
  *********************************************************************************************************
  * @attention
  *					 点亮nLED_1 : GPF4
  *					 点亮nLED_2 : GPF5
  *					 点亮nLED_4 : GPF6
  *					 配置GPF4,GPF5,GPF6为输出引脚
  *					 设置GPF4,GPF5,GPF6输出高电平
  *********************************************************************************************************
  */

#include "led.h"

#if 0
/**********************************************************************************************************
 @Function			void delay(void)
 @Description			delay
 @Input				nCount
 @Return				void
**********************************************************************************************************/
void delay(int nCount)
{
	while (nCount--);
}
#endif

/**********************************************************************************************************
 @Function			int led_on(int which)
 @Description			led_on
 @Input				which
 @Return				int
**********************************************************************************************************/
int led_on(int which)
{
	GPFCON = 0x00001500;
	
	if (which == 1)
		GPFDAT = 0x00000000;
	else
		GPFDAT = 0xFFFFFFFF;
}

/**********************************************************************************************************
 @Function			void S3C2440_LedInitialized(void)
 @Description			S3C2440_LedInitialized
 @Input				void
 @Return				void
**********************************************************************************************************/
void S3C2440_LedInitialized(void)
{
	/* -配置GPF4,GPF5,GPF6为输出引脚- */
	GPFCON &= ~((3<<8) | (3<<10) | (3<<12));
	GPFCON |=  ((1<<8) | (1<<10) | (1<<12));
}

#if 0
/**********************************************************************************************************
 @Function			int main(int argc, char const *argv[])
 @Description			Main
 @Input				void
 @Return				int
**********************************************************************************************************/
int main(int argc, char const *argv[])
{
#if 0
	/* -配置GPF4,GPF5,GPF6为输出引脚-
	 * -把 0x00001500 写到地址 0x56000050-
	 */
	GPFCON = 0x00001500;
	
	/* -配置GPF4,GPF5,GPF6输出低电平-
	 * -把 0x00000000 写到地址 0x56000054-
	 */
	GPFDAT = 0x00000000;
#endif
	
#if 0
	/* -配置GPF4,GPF5,GPF6为输出引脚- */
	GPFCON &= ~((3<<8) | (3<<10) | (3<<12));
	GPFCON |=  ((1<<8) | (1<<10) | (1<<12));
#endif
	
	S3C2440_LedInitialized();
	
	while (true) {
		S3C2440_LED1_ON();
		S3C2440_LED2_OFF();
		S3C2440_LED3_OFF();
		delay(0x0000FFFF);
		S3C2440_LED1_OFF();
		S3C2440_LED2_ON();
		S3C2440_LED3_OFF();
		delay(0x0000FFFF);
		S3C2440_LED1_OFF();
		S3C2440_LED2_OFF();
		S3C2440_LED3_ON();
		delay(0x0000FFFF);
	}
	
	return 0;
}
#endif

/********************************************** END OF FLEE **********************************************/
